content/post/nfs-over-rdma/logs/rdma_fio_bs1024k_iodepth16.log
task1: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=17447: Sat Jul 20 23:11:37 2024
  read: IOPS=2756, BW=2756MiB/s (2890MB/s)(80.8GiB/30006msec)
    slat (usec): min=31, max=1178, avg=34.65, stdev= 7.36
    clat (usec): min=1123, max=15515, avg=5769.05, stdev=152.97
     lat (usec): min=1224, max=15551, avg=5803.70, stdev=151.96
    clat percentiles (usec):
     |  1.00th=[ 5735],  5.00th=[ 5735], 10.00th=[ 5735], 20.00th=[ 5735],
     | 30.00th=[ 5735], 40.00th=[ 5735], 50.00th=[ 5800], 60.00th=[ 5800],
     | 70.00th=[ 5800], 80.00th=[ 5800], 90.00th=[ 5800], 95.00th=[ 5800],
     | 99.00th=[ 5800], 99.50th=[ 5800], 99.90th=[ 6194], 99.95th=[ 6521],
     | 99.99th=[15008]
   bw (  MiB/s): min= 2688, max= 2760, per=100.00%, avg=2756.81, stdev= 9.14, samples=59
   iops        : min= 2688, max= 2760, avg=2756.81, stdev= 9.14, samples=59
  lat (msec)   : 2=0.01%, 4=0.04%, 10=99.93%, 20=0.02%
  cpu          : usr=0.43%, sys=9.97%, ctx=82696, majf=0, minf=527
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=82699,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=2756MiB/s (2890MB/s), 2756MiB/s-2756MiB/s (2890MB/s-2890MB/s), io=80.8GiB (86.7GB), run=30006-30006msec