content/post/nfs-over-rdma/logs/rdma_fio_bs128k_iodepth3.log
task1: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=3
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=14950: Sat Jul 20 22:35:58 2024
  read: IOPS=21.9k, BW=2734MiB/s (2867MB/s)(80.1GiB/30001msec)
    slat (nsec): min=5140, max=194900, avg=7159.28, stdev=679.52
    clat (usec): min=98, max=2441, avg=129.64, stdev=18.47
     lat (usec): min=105, max=2449, avg=136.80, stdev=18.50
    clat percentiles (usec):
     |  1.00th=[  126],  5.00th=[  128], 10.00th=[  128], 20.00th=[  129],
     | 30.00th=[  129], 40.00th=[  129], 50.00th=[  129], 60.00th=[  130],
     | 70.00th=[  130], 80.00th=[  130], 90.00th=[  130], 95.00th=[  133],
     | 99.00th=[  137], 99.50th=[  145], 99.90th=[  408], 99.95th=[  586],
     | 99.99th=[  873]
   bw (  MiB/s): min= 2717, max= 2746, per=100.00%, avg=2734.35, stdev= 6.76, samples=59
   iops        : min=21742, max=21968, avg=21874.81, stdev=54.07, samples=59
  lat (usec)   : 100=0.01%, 250=99.86%, 500=0.06%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=1.80%, sys=18.41%, ctx=655598, majf=0, minf=108
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=656213,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=3

Run status group 0 (all jobs):
   READ: bw=2734MiB/s (2867MB/s), 2734MiB/s-2734MiB/s (2867MB/s-2867MB/s), io=80.1GiB (86.0GB), run=30001-30001msec