content/post/nfs-over-rdma/logs/rdma_fio_bs16k_iodepth64.log
task1: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=64
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=13748: Sat Jul 20 22:21:42 2024
  read: IOPS=162k, BW=2533MiB/s (2656MB/s)(74.2GiB/30001msec)
    slat (nsec): min=1546, max=81035, avg=2543.12, stdev=520.73
    clat (usec): min=215, max=24030, avg=392.02, stdev=68.78
     lat (usec): min=218, max=24032, avg=394.56, stdev=68.78
    clat percentiles (usec):
     |  1.00th=[  367],  5.00th=[  371], 10.00th=[  375], 20.00th=[  383],
     | 30.00th=[  383], 40.00th=[  388], 50.00th=[  388], 60.00th=[  392],
     | 70.00th=[  396], 80.00th=[  396], 90.00th=[  400], 95.00th=[  408],
     | 99.00th=[  457], 99.50th=[  578], 99.90th=[  914], 99.95th=[  979],
     | 99.99th=[ 3916]
   bw (  MiB/s): min= 2438, max= 2555, per=100.00%, avg=2532.71, stdev=21.71, samples=59
   iops        : min=156090, max=163582, avg=162093.63, stdev=1389.37, samples=59
  lat (usec)   : 250=0.01%, 500=99.32%, 750=0.40%, 1000=0.23%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=11.69%, sys=54.42%, ctx=3035110, majf=0, minf=264
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=4862651,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2533MiB/s (2656MB/s), 2533MiB/s-2533MiB/s (2656MB/s-2656MB/s), io=74.2GiB (79.7GB), run=30001-30001msec