content/post/nfs-over-rdma/logs/rdma_fio_bs256k_iodepth24.log
task1: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=24
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=15731: Sat Jul 20 22:45:09 2024
  read: IOPS=11.0k, BW=2753MiB/s (2887MB/s)(80.7GiB/30003msec)
    slat (usec): min=8, max=740, avg=10.80, stdev= 2.50
    clat (usec): min=632, max=6618, avg=2167.82, stdev=42.57
     lat (usec): min=699, max=6628, avg=2178.61, stdev=42.59
    clat percentiles (usec):
     |  1.00th=[ 2147],  5.00th=[ 2180], 10.00th=[ 2180], 20.00th=[ 2180],
     | 30.00th=[ 2180], 40.00th=[ 2180], 50.00th=[ 2180], 60.00th=[ 2180],
     | 70.00th=[ 2180], 80.00th=[ 2180], 90.00th=[ 2180], 95.00th=[ 2180],
     | 99.00th=[ 2245], 99.50th=[ 2278], 99.90th=[ 2343], 99.95th=[ 2442],
     | 99.99th=[ 2999]
   bw (  MiB/s): min= 2740, max= 2754, per=100.00%, avg=2753.28, stdev= 2.05, samples=60
   iops        : min=10960, max=11016, avg=11013.13, stdev= 8.20, samples=60
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.32%, 4=99.68%, 10=0.01%
  cpu          : usr=1.11%, sys=13.29%, ctx=330385, majf=0, minf=523
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=330417,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=24

Run status group 0 (all jobs):
   READ: bw=2753MiB/s (2887MB/s), 2753MiB/s-2753MiB/s (2887MB/s-2887MB/s), io=80.7GiB (86.6GB), run=30003-30003msec