content/post/nfs-over-rdma/logs/rdma_fio_bs256k_iodepth4.log
task1: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=4
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=15505: Sat Jul 20 22:42:36 2024
  read: IOPS=11.0k, BW=2751MiB/s (2885MB/s)(80.6GiB/30001msec)
    slat (nsec): min=9867, max=236292, avg=12149.36, stdev=968.14
    clat (usec): min=184, max=1899, avg=350.94, stdev= 9.75
     lat (usec): min=255, max=1910, avg=363.09, stdev= 9.84
    clat percentiles (usec):
     |  1.00th=[  347],  5.00th=[  351], 10.00th=[  351], 20.00th=[  351],
     | 30.00th=[  351], 40.00th=[  351], 50.00th=[  351], 60.00th=[  351],
     | 70.00th=[  351], 80.00th=[  351], 90.00th=[  351], 95.00th=[  355],
     | 99.00th=[  355], 99.50th=[  359], 99.90th=[  461], 99.95th=[  490],
     | 99.99th=[  652]
   bw (  MiB/s): min= 2739, max= 2754, per=100.00%, avg=2751.77, stdev= 2.61, samples=59
   iops        : min=10958, max=11016, avg=11007.08, stdev=10.42, samples=59
  lat (usec)   : 250=0.01%, 500=99.96%, 750=0.04%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.06%, sys=14.67%, ctx=330163, majf=0, minf=264
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=330174,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=2751MiB/s (2885MB/s), 2751MiB/s-2751MiB/s (2885MB/s-2885MB/s), io=80.6GiB (86.6GB), run=30001-30001msec