content/post/nfs-over-rdma/logs/rdma_fio_bs32k_iodepth64.log
task1: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=64
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=14271: Sat Jul 20 22:27:49 2024
  read: IOPS=87.0k, BW=2719MiB/s (2851MB/s)(79.7GiB/30001msec)
    slat (nsec): min=2080, max=79008, avg=3183.84, stdev=453.46
    clat (usec): min=210, max=2118, avg=731.99, stdev=10.09
     lat (usec): min=214, max=2185, avg=735.18, stdev=10.15
    clat percentiles (usec):
     |  1.00th=[  725],  5.00th=[  725], 10.00th=[  734], 20.00th=[  734],
     | 30.00th=[  734], 40.00th=[  734], 50.00th=[  734], 60.00th=[  734],
     | 70.00th=[  734], 80.00th=[  734], 90.00th=[  734], 95.00th=[  734],
     | 99.00th=[  734], 99.50th=[  742], 99.90th=[  775], 99.95th=[  799],
     | 99.99th=[ 1090]
   bw (  MiB/s): min= 2705, max= 2720, per=100.00%, avg=2719.46, stdev= 2.09, samples=59
   iops        : min=86582, max=87052, avg=87022.68, stdev=67.01, samples=59
  lat (usec)   : 250=0.01%, 500=0.01%, 750=99.71%, 1000=0.27%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=7.76%, sys=38.37%, ctx=2598636, majf=0, minf=520
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=2610356,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2719MiB/s (2851MB/s), 2719MiB/s-2719MiB/s (2851MB/s-2851MB/s), io=79.7GiB (85.5GB), run=30001-30001msec